IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 TST-NAME PIC A(30).
   01 TST-NUM PIC 9(5) VALUE 12345.

PROCEDURE DIVISION.
   DISPLAY 'Hello World'.
   MOVE 'Jim' TO TST-NAME.
   DISPLAY "My name is "TST-NAME.
   DISPLAY "Testing... Testing... "TST-NUM.
STOP RUN.
